In [1]:
mysql://scott:tiger@mysql:3306/default

In [20]:
show tables;

,Tables_in_default
0,castings
1,countries
2,genres
3,movies
4,peoples
5,purchase_20201025
6,purchase_20201026
7,rates
8,seoul_popular_trip
9,user_20201025
10,user_20201026

In [3]:
select * from seoul_popular_trip limit 10;

,category,id,name,address,naddress,tel,tag
0,0,281,통인시장,110-043 서울 종로구 통인동 10-3,03036 서울 종로구 자하문로15길 18,02-722-0911,"엽전도시락,종로통인시장,통인시장닭꼬치,런닝맨,엽전시장,통인시장데이트,효자베이커리,통인시장, 1박2일,기름떡볶이"
1,0,345,타르틴,140-863 서울 용산구 이태원동 119-15,04350 서울 용산구 이태원로23길 4 (이태원동),02-3785-3400,"타르틴,이태원디저트카페,파이,런닝맨,파이맛집,이태원맛집, 유재석,식신로드,타르트맛집"
2,0,383,해랑,135-827 서울 강남구 논현동 183,06120 서울 강남구 강남대로118길 12 (부경빌딩),02-544-7270,"해물탕,해물음식점,해물요리,강남맛집,논현동음식점,강남,신논현맛집,해랑"
3,0,413,인도로 가는 길,110-300 서울 종로구 관훈동 198-36,"03149 서울 종로구 인사동5길 20 (관훈동, 오원빌딩)",02-738-7773,"인도 요리,인도레스토랑,인도로 가는 길,광화문,할랄레스토랑,인도음식점,인사동음식점,커리음식점"
4,0,420,올데이 브런치 카페 B Meal(비밀),140-893 서울 용산구 한남동 738-7,04348 서울 용산구 이태원로55가길 35,02-797-0715,"이태원브런치,브런치음식점,올데이 브런치 카페 B Meal,카페,한남동음식점,이태원,이태원음식점,한남동카페,이태원카페"
5,0,428,장이오,137-857 서울 서초구 서초동 1321-9,06619 서울 서초구 강남대로55길 24 (풍림아이원매직),02-3473-1025,"장이오,강남,한식음식점,한식전문점,강남역음식점,된장찌개,된장,서초동음식점, 간장, 고추장"
6,0,429,진진바라 (서울역점),140-709 서울 용산구 동자동 12,04323 서울 용산구 후암로 107 (게이트웨이타워),02-777-8004,"진진바라,서울역음식점,용산음식점,한식음식점,서울역,한정식,한식전문점"
7,0,441,울프강 스테이크 하우스,135-954 서울 강남구 청담동 89-6,"06016 서울 강남구 선릉로152길 21 (청담동, 영인빌딩)",02-556-8700,"뉴욕3대스테이크,스테이크,스테이크음식점,청담동음식점,강남,레스토랑,울프강 스테이크 하우스"
8,0,446,난향,120-834 서울 서대문구 창천동 72-21,03787 서울 서대문구 신촌로 67 (거촌빌딩),02-322-6900,"중화요리,중국집,난향,신촌음식점,중국 음식점,고급중식당,중식레스토랑"
9,0,463,논현삼계탕(명동점),100-860 서울 중구 충무로2가 7-1,04537 서울 중구 명동10길 41,02-518-4602,"논현삼계탕,명동음식점,삼계탕전문점,명동,백숙,보양식,삼계탕"

In [7]:
desc foo

,Field,Type,Null,Key,Default,Extra
0,id,int(11),YES,,None,
1,name,varchar(50),YES,,None,

In [5]:
create table foo (id int, name varchar(50));

```
movies
 |-- movie: integer (nullable = true)
 |-- title: string (nullable = true)
 |-- title_eng: string (nullable = true)
 |-- year: integer (nullable = true)
 |-- grade: string (nullable = true)
 
peoples
 |-- people: integer (nullable = true)
 |-- korean: string (nullable = true)
 |-- original: string (nullable = true)
 
castings
 |-- movie: integer (nullable = true)
 |-- people: integer (nullable = true)
 |-- order: integer (nullable = true)
 |-- leading: integer (nullable = true)

countries
 |-- movie: integer (nullable = true)
 |-- country: string (nullable = true)

genres
 |-- movie: integer (nullable = true)
 |-- genre: string (nullable = true)

rates
 |-- user: integer (nullable = true)
 |-- movie: integer (nullable = true)
 |-- rate: integer (nullable = true)
 |-- time: integer (nullable = true)
```

In [21]:
create table if not exists movies (movie int, title varchar(255), title_eng varchar(255), year int, grade varchar(50));

In [22]:
create table if not exists peoples (people int, korean varchar(255), original varchar(255));

In [23]:
create table if not exists castings (movie int, people int, `order` int, `leading` int);

In [24]:
create table if not exists countries (movie int, country varchar(255));

In [26]:
create table if not exists genres (movie int, genre varchar(50));

In [39]:
create table if not exists rates (user int, movie int, rate int, `time` int, `timestamp` varchar(50));

In [30]:
select * from movies limit 10;

,movie,title,title_eng,year,grade
0,10001,시네마 천국,"Cinema Paradiso , 1988",2013.0,전체 관람가
1,10002,빽 투 더 퓨쳐,"Back To The Future , 1985",2015.0,12세 관람가
2,10003,빽 투 더 퓨쳐 2,"Back To The Future Part 2 , 1989",2015.0,12세 관람가
3,10004,빽 투 더 퓨쳐 3,"Back To The Future Part III , 1990",1990.0,전체 관람가
4,10005,스타워즈 에피소드 4 - 새로운 희망,"Star Wars , 1977",1997.0,PG
5,10006,스타워즈 에피소드 5 - 제국의 역습,"Star Wars Episode V: The Empire Strikes Back , 1980",1997.0,PG
6,10007,스타워즈 에피소드 6 - 제다이의 귀환,"Star Wars: Episode VI: Return Of The Jedi , 1983",1997.0,PG
7,10008,슈퍼맨,"Superman , 1978",1979.0,PG
8,10009,슈퍼맨 2,"Superman II , 1980",1981.0,PG
9,10010,슈퍼맨 3,"Superman III , 1983",NaN,전체 관람가

In [31]:
select * from peoples limit 10;

,movie,people,order,leading
0,10001,4374,1,1
1,10001,178,2,1
2,10001,3241,3,1
3,10001,47952,4,1
4,10001,47953,5,0
5,10001,19538,6,0
6,10001,18991,7,0
7,10001,47954,8,0
8,10001,6038,9,0
9,10001,24102,10,0

In [32]:
select * from castings limit 10;

,movie,people,order,leading
0,10001,4374,1,1
1,10001,178,2,1
2,10001,3241,3,1
3,10001,47952,4,1
4,10001,47953,5,0
5,10001,19538,6,0
6,10001,18991,7,0
7,10001,47954,8,0
8,10001,6038,9,0
9,10001,24102,10,0

In [33]:
select * from countries limit 10;

,movie,country
0,10001,이탈리아
1,10001,프랑스
2,10002,미국
3,10003,미국
4,10004,미국
5,10005,미국
6,10006,미국
7,10007,미국
8,10008,영국
9,10009,영국

In [34]:
select * from genres limit 10;

,movie,genre
0,10001,드라마
1,10001,멜로/로맨스
2,10002,SF
3,10002,코미디
4,10003,SF
5,10003,코미디
6,10004,서부
7,10004,SF
8,10004,판타지
9,10004,코미디

In [38]:
select * from rates limit 10;

,user,movie,rate,time
0,0,10003,7,1494128040
1,0,10004,7,1467529800
2,0,10018,9,1513344120
3,0,10021,9,1424497980
4,0,10022,7,1427627340
5,0,10023,7,1428738480
6,0,10024,4,1429359420
7,0,10025,4,1433590980
8,0,10028,10,1425108480
9,0,10029,9,1513602720

In [40]:
desc rates;

,Field,Type,Null,Key,Default,Extra
0,user,int(11),YES,,None,
1,movie,int(11),YES,,None,
2,rate,int(11),YES,,None,
3,time,int(11),YES,,None,
4,timestamp,varchar(50),YES,,None,